pole =  [['*','*','*','*','*','*','*','*','*','*'],
         ['*','*','*','*','*','*','*','*','*','*'],
         ['*','*','*','*','*','*','*','*','*','*'],
         ['*','*','*','*','*','*','*','*','*','*'],
         ['*','*','*','*','*','*','*','*','*','*'],
         ['*','*','*','*','*','*','*','*','*','*'],
         ['*','*','*','*','*','*','*','*','*','*'],
         ['*','*','*','*','*','*','*','*','*','*'],
         ['*','*','*','*','*','*','*','*','*','*'],
         ['*','*','*','*','*','*','*','*','*','*']]
for stroka in pole:
    for kletka in stroka:
        print(kletka,'',end='')
    print()
while True:
    placeByUser = int(input('Введите местоположение: '))
    if placeByUser <= 100:
        placeByO = placeByUser - 1
        pole() = 'O'
        for stroka in pole:
            for kletka in stroka:
                print(kletka,'',end='')
            print()
    else:
        print('Неверное поле')
        

